Repository: pypi-data/pypi-mirror-244
Catalog: packages/collective.resourcebooking/collective.resourcebooking-1.0b1.tar.gz/collective.resourcebooking-1.0b1/src/collective/resourcebooking/locales/*/LC_MESSAGES/collective.resourcebooking.po
Languages: de

source: A bookable resource.
de: Eine buchbare Ressource

source: A container holding resources bookings.
de: Ein Kontainer welcher Buchungen enthält

source: A container to hold available resources and there bookings
de: Ein Kontainer welcher verfügbare Ressourcen und deren Buchungen enthält

source: A resource booking.
de: Eine Buchung

source: Afternoon
de: Nachmittag

source: Booking
de: Buchung

source: Bookings
de: Buchungen

source: Choose a resource to book
de: Wähle eine zu buchende Ressource

source: Container holding available resources to book.
de: Kontainer welcher verfügbare Ressourcen enthält

source: Day
de: Tag

source: End
de: Ende

source: Morning
de: Vormittag

source: Resource
de: Ressource

source: ResourceBooking
de: Ressourcenbuchung

source: Resources
de: Ressourcen

source: Start
de: Beginn

source: The choosen timeslot is not available on that day!
de: Der gewählte Zeitslot ist nicht verfügbar!

source: The timeslot is not available on that day.
de: Der gewählte Zeitslot ist nicht verfügbar!

source: Timeslot
de: Zeitslot

source: label_calendar_week
de: KW

source: label_next_week
de: nächste Woche

source: label_previous_week
de: vorherige Woche
