Repository: pypi-data/pypi-mirror-244
Catalog: packages/mds-cashbook-dataexchange/mds_cashbook_dataexchange-7.0.5-py3-none-any.whl/trytond/modules/cashbook_dataexchange/locale/*.po
Languages: de

# model:ir.message,text:msg_wiz_categories_found
source: The following categories are now imported: %(categories)s
de: Die folgenden Kategorien werden nun importiert: %(categories)s

# model:ir.message,text:msg_wiz_transactions_found
source: The following transactionen are now imported: Credit: %(credit)s Debit: %(debit)s Balance: %(balance)s Number of transactions: %(quantity)s
de: Die folgenden Transaktionen werden nun importiert: Einnahmen: %(credit)s Ausgaben: %(debit)s Saldo: %(balance)s Anzahl Transactionen: %(quantity)s

# model:ir.message,text:msg_wiz_parties_found
source: The following %(numparties)s parties are now imported:
de: Die folgenden %(numparties)s Parteien werden nun importiert:

# model:ir.message,text:msg_wiz_no_categories
source: No categories were found in the file.
de: In der Datei wurden keine Kategorien gefunden.

# model:ir.message,text:msg_wiz_no_bank
source: No transactions were found in the file.
de: In der Datei wurden keine Transaktionen gefunden.

# model:ir.message,text:mds_import_category_notfound
source: The category '%(catname)s' was not found.
de: Die Kategorie '%(catname)s' wurde nicht gefunden.

# model:ir.message,text:mds_import_party_notfound
source: The party '%(pname)s' was not found.
de: Die Partei '%(pname)s' wurde nicht gefunden.

# model:ir.message,text:mds_import_many_parties_found
source: For the party '%(pname)s' of the import, several parties were found in the system. Use: '%(pname2)s'
de: Für die Partei '%(pname)s' des Imports wurden mehrere Parteien im System gefunden. Verwende: '%(pname2)s'

# model:ir.message,text:mds_import_many_categories_found
source: For the category '%(catname1)s' of the import, several categories were found in the system. Use: '%(catname2)s'
de: Für die Kategorie '%(catname1)s' des Imports wurden mehrere Kategorien im System gefunden. Verwende: '%(catname2)s'

# model:ir.message,text:mds_import_many_books_found
source: For the cashbook '%(bookname1)s' of the import, several cashbooks were found in the system. Use: '%(bookname2)s'
de: Für das Kassenbuch '%(bookname1)s' des Imports wurden mehrere Kassenbücher im System gefunden. Verwende: '%(bookname2)s'

# model:ir.message,text:mds_import_checknumber
source: Cheque No.
de: Scheck-Nr:

# model:ir.message,text:mds_import_address
source: Address
de: Adresse

# model:ir.message,text:msg_wiz_transactions_error
source: When reading the QIF file, there were the following problems:
de: Beim Einlesen der QIF-Datei gab es folgende Probleme:

# model:ir.message,text:mds_import_no_category
source: No category has been assigned for transaction '%(trdata)s'.
de: Für die Transaktion '%(trdata)s' wurde keine Kategorie zugeordnet.

# model:ir.message,text:mds_import_no_account
source: No cashbook has been assigned for transaction '%(trdata)s'.
de: Für die Transaktion '%(trdata)s' wurde kein Kassenbuch zugeordnet.

# model:ir.message,text:mds_import_book_notfound
source: The cashbook '%(bookname)s' was not found.
de: Das Kassenbuch '%(bookname)s' wurde nicht gefunden.

# model:ir.message,text:mds_import_category_not_match
source: The category '%(catname)s' of the split booking does not match the bookingtype '%(bktype)s' (data: '%(data)s')
de: Die Kategorie '%(catname)s' der Splitbuchung paßt nicht zum Buchungstyp '%(bktype)s' (Daten: '%(data)s')

# model:ir.message,text:msg_ignore_null_booking
source: Ignore empty booking, no category, amount zero: %(trinfo)s
de: Ignoriere leere Buchung, keine Kategorie, Betrag Null: %(trinfo)s

# model:ir.action,name:act_import_qif_wizard
source: Import QIF-File
de: QIF-Datei importieren

# model:ir.action,name:qif_category_report
source: Export QIF-File
de: QIF-Datei exportieren

# model:ir.action,name:qif_transaction_report
source: Export QIF-File
de: QIF-Datei exportieren

# model:cashbook_dataexchange.qif_imp_wiz,name:
source: Import QIF-File
de: QIF-Datei importieren

# wizard_button:cashbook_dataexchange.qif_imp_wiz,start,end:
source: Cancel
de: Abbruch

# wizard_button:cashbook_dataexchange.qif_imp_wiz,start,readf:
source: Read File
de: Datei lesen

# wizard_button:cashbook_dataexchange.qif_imp_wiz,showinfo,end:
source: Cancel
de: Abbruch

# wizard_button:cashbook_dataexchange.qif_imp_wiz,showinfo,importf:
source: Import Data
de: Daten importieren

# model:cashbook_dataexchange.qif_imp_wiz.start,name:
source: Import QIF-File
de: QIF-Datei importieren

# field:cashbook_dataexchange.qif_imp_wiz.start,company:
source: Company
de: Unternehmen

# field:cashbook_dataexchange.qif_imp_wiz.start,book:
source: Cashbook
de: Kassenbuch

# field:cashbook_dataexchange.qif_imp_wiz.start,file_:
source: QIF-File
de: QIF-Datei

# model:cashbook_dataexchange.qif_imp_wiz.info,name:
source: Import QIF-File
de: QIF-Datei importieren

# field:cashbook_dataexchange.qif_imp_wiz.info,book:
source: Cashbook
de: Kassenbuch

# field:cashbook_dataexchange.qif_imp_wiz.info,company:
source: Company
de: Unternehmen
