Repository: pypi-data/pypi-mirror-244
Catalog: packages/mds-cashbook-account/mds_cashbook_account-6.0.13.tar.gz/mds_cashbook_account-6.0.13/locale/*.po
Languages: de

# model:ir.message,text:msg_category_account_unique
source: The account is already in use for a category.
de: Das Konto wird bereits für eine Kategorie verwendet.

# model:ir.message,text:msg_line_missing_category_account
source: There is no account associated with the '%(catname)s' category.
de: Der Kategorie '%(catname)s' ist kein Konto zugeordnet.

# model:ir.message,text:msg_line_missing_book_account
source: There is no account associated with the '%(bookname)s' cashbook.
de: Dem Kassenbuch '%(bookname)s' ist kein Konto zugeordnet.

# model:ir.message,text:msg_line_missing_tax
source: There is no tax associated with the '%(catname)s' category.
de: Der Kategorie '%(catname)s' ist keine Steuer zugeordnet.

# model:ir.message,text:msg_line_amount_none
source: The amount for '%(taxname)s' in the line '%(linename)s' cannot be empty.
de: Der Betrag für '%(taxname)s' in der Zeile '%(linename)s' kann nicht leer sein.

# model:ir.message,text:msg_line_tax_tax0
source: Tax Null
de: Steuerfrei

# model:ir.message,text:msg_line_tax_tax1
source: Tax Half
de: Steuer halb

# model:ir.message,text:msg_line_tax_tax2
source: Tax Full
de: Steuer voll

# model:ir.message,text:msg_line_netamount
source: Net
de: Netto

# model:ir.message,text:msg_line_total_mismatch
source: In the line '%(linename)s' is the sum of taxes and net is not equal to the gross amount.
de: In der Zeile '%(linename)s' ist die Summe von Steuern und Netto ist ungleich dem Bruttobetrag.

# model:ir.message,text:msg_line_tax_must_disabled
source: In the line '%(linename)s' the fields for taxes must be inactive for the current bookingtype.
de: Die Felder für Steuern müssen in der Zeile '%(linename)s' beim aktuellen Buchungstyp inaktiv sein.

# model:ir.message,text:msg_line_party_required
source: For the line '%(recname)s' it is necessary to specify a party.
de: Für die Zeile '%(recname)s' ist die Angabe einer Partei notwendig.

# view:cashbook.book:
source: Account Configuration
de: Buchhaltung

# field:cashbook.book,account:
source: Account
de: Konto

# help:cashbook.book,journal:
source: Created account move records are assigned to this journal.
de: Erstellte Buchungssätze werden diesem Journal zugeordnet.

# field:cashbook.book,party_account:
source: Involve party accounts
de: Parteikonten einbeziehen

# help:cashbook.book,party_account:
source: The Receivable/Payable accounts of the party are included in move line records.
de: Die Forderungen/Verbindlichkeiten-Konten der Partei werden in Buchungssätzen einbezogen.

# view:cashbook.line:
source: Moves
de: Buchungssätze

# view:cashbook.line:
source: Net and Tax Amounts
de: Netto und Steuer Beträge

# view:cashbook.line:
source: Tax Lines
de: Steuerzeilen

# view:cashbook.line:
source: If you want to specify taxes, turn on the appropriate fields.
de: Wenn Sie Steuern angeben möchten, schalten Sie die entsprechenden Felder ein.

# view:cashbook.line:
source: The values are automatically calculated based on the tax stored in the category.
de: Die Werte werden automatisch anhand der an der Kategorie hinterlegten Steuer berechnet.

# field:cashbook.line,moves:
source: Moves
de: Buchungssätze

# field:cashbook.line,account_cashbook:
source: Account Cashbook
de: Konto Kassenbuch

# field:cashbook.line,amount_net:
source: Net
de: Netto

# help:cashbook.line,amount_net:
source: Net Amount of current booking.
de: Nettobetrag der Buchung.

# field:cashbook.line,amount_tax0:
source: Tax Null
de: Steuerfrei

# field:cashbook.line,ena_tax0:
source: Tax Null
de: Steuerfrei

# field:cashbook.line,avail_tax0:
source: Tax Null available
de: Steuerfrei verfügbar

# field:cashbook.line,amount_tax1:
source: Tax Half
de: Steuer halb

# field:cashbook.line,ena_tax1:
source: Tax Half
de: Steuer halb

# field:cashbook.line,avail_tax1:
source: Tax Half available
de: Steuer halb verfügbar

# field:cashbook.line,amount_tax2:
source: Tax Full
de: Steuer voll

# field:cashbook.line,ena_tax2:
source: Tax Full
de: Steuer voll

# field:cashbook.line,avail_tax2:
source: Tax Full available
de: Steuer voll verfügbar

# field:cashbook.line,taxes:
source: Tax Lines
de: Steuerzeilen

# view:cashbook.split:
source: Net and Tax Amounts
de: Netto und Steuer Beträge

# view:cashbook.split:
source: If you want to specify taxes, turn on the appropriate fields.
de: Wenn Sie Steuern angeben möchten, schalten Sie die entsprechenden Felder ein.

# view:cashbook.split:
source: The values are automatically calculated based on the tax stored in the category.
de: Die Werte werden automatisch anhand der an der Kategorie hinterlegten Steuer berechnet.

# field:cashbook.split,amount_net:
source: Net
de: Netto

# help:cashbook.split,amount_net:
source: Net Amount of current booking.
de: Nettobetrag der Buchung.

# field:cashbook.split,amount_tax0:
source: Tax Null
de: Steuerfrei

# field:cashbook.split,ena_tax0:
source: Tax Null
de: Steuerfrei

# field:cashbook.split,avail_tax0:
source: Tax Null available
de: Steuerfrei verfügbar

# field:cashbook.split,amount_tax1:
source: Tax Half
de: Steuer halb

# field:cashbook.split,ena_tax1:
source: Tax Half
de: Steuer halb

# field:cashbook.split,avail_tax1:
source: Tax Half available
de: Steuer halb verfügbar

# field:cashbook.split,amount_tax2:
source: Tax Full
de: Steuer voll

# field:cashbook.split,ena_tax2:
source: Tax Full
de: Steuer voll

# field:cashbook.split,avail_tax2:
source: Tax Full available
de: Steuer voll verfügbar

# model:cashbook_account.tax,name:
source: Tax Line
de: Steuerzeile

# field:cashbook_account.tax,line:
source: Line
de: Zeile

# field:cashbook_account.tax,splitline:
source: Split Booking
de: Splitbuchung

# field:cashbook_account.tax,tax:
source: Tax
de: Steuer

# field:cashbook_account.tax,base:
source: Base
de: Netto

# field:cashbook_account.tax,amount:
source: Amount
de: Betrag

# field:cashbook_account.tax,currency:
source: Currency
de: Währung

# field:cashbook_account.tax,currency_digits:
source: Currency Digits
de: Nachkommastellen Währung

# field:cashbook_account.tax,bookingtype:
source: Type
de: Typ

# selection:cashbook_account.tax,bookingtype:
source: Revenue
de: Einnahme

# selection:cashbook_account.tax,bookingtype:
source: Revenue Splitbooking
de: Einnahme Splitbuchung

# selection:cashbook_account.tax,bookingtype:
source: Expense
de: Ausgabe

# selection:cashbook_account.tax,bookingtype:
source: Expense Splitbooking
de: Ausgabe Splitbuchung

# selection:cashbook_account.tax,bookingtype:
source: Transfer from
de: Umbuchung von

# selection:cashbook_account.tax,bookingtype:
source: Transfer to
de: Umbuchung nach

# field:cashbook_account.tax,state:
source: State
de: Status

# selection:cashbook_account.tax,state:
source: Edit
de: Bearbeiten

# selection:cashbook_account.tax,state:
source: Checked
de: Geprüft

# selection:cashbook_account.tax,state:
source: Done
de: Fertig

# field:cashbook_account.tax,state_cashbook:
source: State of Cashbook
de: Kassenbuchstatus

# view:cashbook.category:
source: Account and Tax
de: Konto und Steuer

# field:cashbook.category,account:
source: Account
de: Konto

# field:cashbook.category,account_code:
source: Account
de: Konto

# field:cashbook.category,tax0:
source: Tax Null
de: Steuer Null

# field:cashbook.category,tax1:
source: Tax Half
de: Steuer Halb

# field:cashbook.category,tax2:
source: Tax Full
de: Steuer Voll

# field:cashbook.configuration,cataccno:
source: Category: Show account number
de: Kategorie: Kontonummer zeigen

# help:cashbook.configuration,cataccno:
source: Shows the number of the linked account in the name of a category.
de: Zeigt im Namen einer Kategorie die Nummer des verknüpften Kontos.

# field:cashbook.configuration_user,cataccno:
source: Category: Show account number
de: Kategorie: Kontonummer zeigen

# help:cashbook.configuration_user,cataccno:
source: Shows the number of the linked account in the name of a category.
de: Zeigt im Namen einer Kategorie die Nummer des verknüpften Kontos.
